code/app/controllers/users/registrations_controller.rb

INSERT INTO "users" ("nome", "cognome", "username", "pubblico", "commento", "created_at", "updated_at", "email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
          def create
            @user=User.new(sign_up_params)
            respond_to do |format|
              if @user.save