code/app/controllers/azione_controller.rb

SELECT "aziones".* FROM "aziones" WHERE "aziones"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      @azione =Azione.find(params[:id])