code/app/controllers/comment_controller.rb

  def create
    @commento = Comment.new(comment_params)

    respond_to do |format|
      if @commento.save
---
INSERT INTO "comments" ("user", "isin", "commento", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user", "ilariaviola"], ["isin", "AAPL"], ["commento", "aa"], ["created_at", "2023-03-08 18:55:55.745110"], ["updated_at", "2023-03-08 18:55:55.745110"]]