code/app/controllers/contacts_controller.rb

    def new
        @contact = Contact.new
        @utenti=User.all.order(:username)
---
SELECT "users".* FROM "users" ORDER BY "users"."username" ASC