code/app/controllers/contacts_controller.rb

  def set_select_collections
    @utenti=User.all.order(:username)
    @us=[]
    @us.push(['-','-'])
    @utenti.each do |utente|
---
SELECT "users".* FROM "users" ORDER BY "users"."username" ASC