code/app/controllers/news_controller.rb

SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def index
        @notizia0=News.find(0)
        @notizia1=News.find(1)
        @notizia2=News.find(2)
        @notizia3=News.find(3)
        @notizia4=News.find(4)
        @notizia5=News.find(5)
        @notizia6=News.find(6)
        @notizia7=News.find(7)
        @notizia8=News.find(8)
        @notizia9=News.find(9)