code/app/controllers/screener_controller.rb

SELECT "aziones".* FROM "aziones"
---
    def index
        @risultati = Azione.all