code/app/controllers/users_controller.rb

  def index
    @user=current_user
    if(@user.immagine==nil)
      @user.immagine="profilo"
      @user.save
---
UPDATE "users" SET "updated_at" = ?, "immagine" = ? WHERE "users"."id" = ?  [["updated_at", "2023-03-25 21:12:41.699104"], ["immagine", "profilo"], ["id", 1]]

  def show
    @user = User.find(params[:id])
    if @user.immagine==nil
      @user.immagine="profilo"
    end
    if(current_user==@user)
      redirect_to "/users"
    end
    @azioni=Wallet.where(user:@user.username)
---
SELECT "wallets".* FROM "wallets" WHERE "wallets"."user" = ?  [["user", "LuigiVerdiUsername"]]