code/app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "nome" = ?, "cognome" = ?, "username" = ?, "pubblico" = ?, "commento" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["nome", "Luca"], ["cognome", "Blu"], ["username", "lucab"], ["pubblico", "no"], ["commento", ""], ["updated_at", "2023-03-06 18:14:30.719162"], ["id", 4]]