code/app/controllers/wallets_controller.rb

  def index
    @az=Azione.all
    if !user_signed_in?
      redirect_to '/users/sign_in',notice: 'Per accedere alla pagina del Wallet, è prima necessario autenticarsi col proprio account'
    else
      @curr_user=current_user.username
      @posizioni = Wallet.where(user:@curr_user)
      @azioni = [] #nuova variabile contenente le info dell'azione estratta
      @quantita = [] #variabile indica la quantita di azione i-esima in "posizioni" che l'utente detiene
      @tot=0
      i=0
      @posizioni.each do |posizione|
        @azioni[i]=Azione.where(isin:posizione.azione).first
---
SELECT "aziones".* FROM "aziones" WHERE (isin= @wallets[:azione])
SELECT "wallets".* FROM "wallets" WHERE "wallets"."user" = ?  [["user", "marior"]]
SELECT "wallets".* FROM "wallets" WHERE "wallets"."user" = ?  [["user", "ACCprova"]]
SELECT "aziones".* FROM "aziones" WHERE "aziones"."isin" = ? ORDER BY "aziones"."id" ASC LIMIT ?  [["isin", ""], ["LIMIT", 1]]

  def movimenti
    @az=Azione.all
    lista=[]
    @az.each do |x|
      lista.push(x.isin)
    end
    @isin = params[:isin].upcase
    @numero = params[:quantita].to_i
    if lista.include?(@isin)
      @tmp=Wallet.where(user:current_user.username,azione:@isin).first
      if @tmp==nil
        Wallet.create(user:current_user.username,azione:@isin,quantità:@numero)
      else
        n=@tmp.quantità+@numero
        @tmp.update(quantità:n)
---
SELECT "aziones".* FROM "aziones"
SELECT "wallets".* FROM "wallets" WHERE "wallets"."user" = ? AND "wallets"."azione" = ? ORDER BY "wallets"."id" ASC LIMIT ?  [["user", "ACCprova"], ["azione", "JD"], ["LIMIT", 1]]
INSERT INTO "wallets" ("user", "azione", "quantità", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user", "ACCprova"], ["azione", "JD"], ["quantità", 3], ["created_at", "2023-03-09 17:47:33.120091"], ["updated_at", "2023-03-09 17:47:33.120091"]]
UPDATE "wallets" SET "quantità" = ?, "updated_at" = ? WHERE "wallets"."id" = ?  [["quantità", 13], ["updated_at", "2023-03-08 11:03:33.446357"], ["id", 7]]

  def elimina
    @wallet = Wallet.find_by(azione: params[:isin],user:current_user.username)
    @wallet.destroy
---
SELECT "wallets".* FROM "wallets" WHERE "wallets"."azione" = ? AND "wallets"."user" = ? LIMIT ?  [["azione", "ENPH"], ["user", "ACCprova"], ["LIMIT", 1]]
DELETE FROM "wallets" WHERE "wallets"."id" = ?  [["id", 19]]

  def rimozione
    @wallet=Wallet.where(user:current_user.username)
    @wallet.destroy_all
---
SELECT "wallets".* FROM "wallets" WHERE "wallets"."user" = ?  [["user", "ACCprova"]]
DELETE FROM "wallets" WHERE "wallets"."id" = ?  [["id", 4]]

  def create
    @wallet = Wallet.new(wallet_params)

    respond_to do |format|
      if @wallet.save
---
INSERT INTO "wallets" ("user", "azione", "quantità", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user", nil], ["azione", nil], ["quantità", nil], ["created_at", "2023-03-21 10:17:12.562932"], ["updated_at", "2023-03-21 10:17:12.562932"]]

    def set_wallet
      @wallet = Wallet.find(params[:id])
---
SELECT "wallets".* FROM "wallets" WHERE "wallets"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]