code/app/controllers/wallets_controller.rb

  def movimenti
    @isin = params[:isin]
    @numero = params[:quantita].to_i
    @tmp=Wallet.where(user:current_user.username,azione:@isin).first
---
SELECT "wallets".* FROM "wallets" WHERE "wallets"."user" = ? ORDER BY "isin" ASC  [["user", "ACCprova"]]